Quiz/Quiz/app/controllers/questions_controller.rb

  def create
    @question = Question.new(params_question)
    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("text", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["text", "How old are you?"], ["created_at", "2016-06-15 19:02:44.832590"], ["updated_at", "2016-06-15 19:02:44.832590"]]

  def update
    @question = Question.find(params[:id])
    respond_to do |format|
      if @question.update_attributes(params_question)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "questions" SET "text" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["text", "What your name?"], ["updated_at", "2016-06-15 19:10:09.382205"], ["id", 2]]